## M06 Exercises - Hilde Younce

### Exercise 6.1:

In [5]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
df = pd.DataFrame({'features': [1., 2., 3., 4., 5.], 'labels': [0, 1, 2, 1, 0]})
df

   features  labels
0       1.0       0
1       2.0       1
2       3.0       2
3       4.0       1
4       5.0       0

### Exercise 6.2:

In [7]:
df = df.rename(columns ={'labels': 'label'})
df

   features  label
0       1.0      0
1       2.0      1
2       3.0      2
3       4.0      1
4       5.0      0

### Exercise 6.3:

In [11]:
iris = sns.load_dataset('iris')
iris.sort_values(by=['species'], ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

### Exercise 6.4:

In [14]:
iris.species.value_counts().to_frame()

            count
species
setosa         50
versicolor     50
virginica      50

### Exercise 6.5:

In [19]:
len(iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)])

137

### Exercise 6.6:

In [24]:
iris['min_petal'] = iris[['petal_length', 'petal_width']].apply(lambda x: min(x.petal_width, x.petal_length), axis=1)
iris

,sepal_length,sepal_width,petal_length,petal_width,species,min_petal
0,5.1,3.5,1.4,0.2,setosa,0.2
1,4.9,3.0,1.4,0.2,setosa,0.2
2,4.7,3.2,1.3,0.2,setosa,0.2
3,4.6,3.1,1.5,0.2,setosa,0.2
4,5.0,3.6,1.4,0.2,setosa,0.2
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,2.3
146,6.3,2.5,5.0,1.9,virginica,1.9
147,6.5,3.0,5.2,2.0,virginica,2.0
148,6.2,3.4,5.4,2.3,virginica,2.3
149,5.9,3.0,5.1,1.8,virginica,1.8

### Exercise 6.7:

In [28]:
pd.pivot_table(iris, values=["sepal_width", "petal_width"], columns=["species"], aggfunc = {np.mean, np.median})

/var/folders/cf/5rwlr8qs4l31v6xq2mfzt7x40000gn/T/ipykernel_33629/2764211296.py:1: FutureWarning: The provided callable <function mean at 0x11032b420> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(iris, values=["sepal_width", "petal_width"], columns=["species"], aggfunc = {np.mean, np.median})
/var/folders/cf/5rwlr8qs4l31v6xq2mfzt7x40000gn/T/ipykernel_33629/2764211296.py:1: FutureWarning: The provided callable <function median at 0x11044f1a0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  pd.pivot_table(iris, values=["sepal_width", "petal_width"], columns=["species"], aggfunc = {np.mean, np.median})
/var/folders/cf/5rwlr8qs4l31v6xq2mfzt7x40000gn/T/ipykernel_33629/2764211296.py:1: FutureWarning: The provided callable <function mean at 0x11032b420> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(iris, values=["sepal_width", "petal_width"], columns=["species"], aggfunc = {np.mean, np.median})

species             setosa  versicolor  virginica
petal_width mean     0.246       1.326      2.026
            median   0.200       1.300      2.000
sepal_width mean     3.428       2.770      2.974
            median   3.400       2.800      3.000

### Exercise 6.8:

In [29]:
df1 = pd.DataFrame({'key': ["hilde", "jack"], 'val1': [1,2]})
df1 = df1.set_index('key')
df2 = pd.DataFrame({'key': ["hilde", "jack", "javier"], 'val2': [3,4,5]})
df2 = df2.set_index('key')

In [30]:
df1

       val1
key
hilde     1
jack      2

In [31]:
df2

        val2
key
hilde      3
jack       4
javier     5

In [33]:
inner = pd.merge(df1, df2, on='key', how='inner')
inner

       val1  val2
key
hilde     1     3
jack      2     4

### Exercise 6.9:

In [36]:
s = pd.Series([1,1,2,3,5,8])
print(s)
arr = s.values
arr = arr.reshape(2,3)
arr

0    1
1    1
2    2
3    3
4    5
5    8
dtype: int64

array([[1, 1, 2],
       [3, 5, 8]])

In [37]:
arr.shape

(2, 3)

### Exercise 6.10:

In [40]:
cats = pd.DataFrame({'breed': ['persian','persian','siamese','himalayan','burmese'],
                     'color': ['calico','white', 'seal point','cream','sable']})
dummy_cats = pd.get_dummies(cats, prefix=['b','c'])
dummy_cats

,b_burmese,b_himalayan,b_persian,b_siamese,c_calico,c_cream,c_sable,c_seal point,c_white
0,False,False,True,False,True,False,False,False,False
1,False,False,True,False,False,False,False,False,True
2,False,False,False,True,False,False,False,True,False
3,False,True,False,False,False,True,False,False,False
4,True,False,False,False,False,False,True,False,False